#-*-coding:utf-8 -*-
import myUpbit   #우리가 만든 함수들이 들어있는 모듈
import time
import pyupbit

import ende_key  #암복호화키
import my_key    #업비트 시크릿 액세스키


'''
스토캐스틱 지표 함수를 추가했습니다!
'''
#암복호화 클래스 객체를 미리 생성한 키를 받아 생성한다.
simpleEnDecrypt = myUpbit.SimpleEnDecrypt(ende_key.ende_key)

#암호화된 액세스키와 시크릿키를 읽어 복호화 한다.
Upbit_AccessKey = simpleEnDecrypt.decrypt(my_key.upbit_access)
Upbit_ScretKey = simpleEnDecrypt.decrypt(my_key.upbit_secret)

#업비트 객체를 만든다
upbit = pyupbit.Upbit(Upbit_AccessKey, Upbit_ScretKey)

df = pyupbit.get_ohlcv("KRW-BTC",interval="minute15") #여기선 비트코인의 15분봉 데이타를 가져온다.

#스토캐스틱 함수를 사용해 값을 받아옵니다.


#---------------------------------------------#
#아래 지표들 구할때 제가 현재 캔들을 -1 이 아니라 -2로 
#이전 캔들을 -2가 아니라 -3으로 수정했습니다. 이유는 https://blog.naver.com/zacra/222567868086 참고하세요!
#---------------------------------------------#



print("-----------------------------------------------")
#이전 캔들의 스토캐스틱
Stoch_dic_before = myUpbit.GetStoch(df,5,-3)
print("before - fast_k:",Stoch_dic_before['fast_k'],", slow_d:", Stoch_dic_before['slow_d'])

print("-----------------------------------------------")
#현재 캔들의 스토캐스틱
Stoch_dic_now = myUpbit.GetStoch(df,5,-2)
print("now - fast_k:",Stoch_dic_now['fast_k'],", slow_d:", Stoch_dic_now['slow_d'])







#################################################################################################################
#################################################################################################################
#################################################################################################################
#################################################################################################################
#################################################################################################################

#반드시 이 글을 읽고 수정하세요 https://blog.naver.com/zacra/222567868086
# 지표를 활용할 때 현재 캔들 -1 과 이전 캔들 -2는 값이 같아지는 경우가 생길 수 있습니다. 
# (봇이 캔들이 변경되는 시점에 주로 실행되기에 이 경우 현재 캔들 기준으로 구한 지표 값과 이전 캔들 기준으로 구한 지표 값이 동일해 지는 상황압니다,)
# 따라서 이전 캔들 -2, 이이전 캔들 -3으로 조합해야 원하는 결과를 얻을 수 있습니다.
# 쉽게 이야기해서 현재 캔들을 -2, 이전 캔들을 -3으로 보는게 좋다는 거죠. 어자피 진짜 현재 캔들 -1과 이전 캔들 -2의 값이 보통 같을테니까요. 
# (이전 캔들의 종가와 현재 캔들의 시가가 거의 같은 경우가 많으니까요!)

#################################################################################################################
#################################################################################################################
#################################################################################################################
#################################################################################################################
#################################################################################################################










